---
type: ValueAtPointBase
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ValueAtPointBase

`Autodesk.Revit.DB.ValueAtPointBase` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ClearAllFlags | 2012 | `public void ClearAllFlags ()` |
| Method | ClearFlagsAt | 2012 | `public void ClearFlagsAt ( int measurement )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetFlags | 2012 | `public int GetFlags ( int measurement )` |
| Method | SetFlags | — | `` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |